Revit 2027 API
GeometryCreationUtilities.CreateBlendGeometry Method
Overload List
Name | Description
CreateBlendGeometry(CurveLoop, CurveLoop, ICollection<VertexPair>) |  Creates a solid by blending two closed curve loops lying in non-coincident planes.
CreateBlendGeometry(CurveLoop, CurveLoop, ICollection<VertexPair>, SolidOptions) |  Creates a solid by blending two closed curve loops lying in non-coincident planes.
Top
See Also
Reference
GeometryCreationUtilities Class
Autodesk.Revit.DB Namespace